---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.HostObjFailures
source: html/e772a146-47dd-2d11-eae4-b84c7577c912.htm
---
# Autodesk.Revit.DB.BuiltInFailures.HostObjFailures

Failures about HostObj.

## Syntax (C#)
```csharp
public static class HostObjFailures
```